Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If you are not the administrator of your computer, you may need to select the Current user option.
ja: コンピュータの管理者でない場合は、「現在のユーザー」オプションを選択する必要がある場合があります。

source: If you are running another AutoHotkey executable directly, the name of the script depends on the executable.
ja: 他のAutoHotkeyの実行ファイルを直接実行している場合、スクリプトの名前は実行ファイルによって異なります。

source: If you are updating old code and get a TypeError due to passing an Integer to ComObject, it's likely that you should be calling ComValue instead.
ja: 古いコードを更新しているときに、ComObjectにIntegerを渡したためにTypeErrorが発生した場合、代わりにComValueを呼び出す必要がある可能性があります。

source: If you are using AutoHotkey without having installed it, look in the directory which contains AutoHotkey.exe.
ja: AutoHotkeyをインストールせずに使用する場合は、AutoHotkey.exeが含まれるディレクトリを検索してください。

source: If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all.
ja: もしあなたが、本許諾書に基づくあなたの義務とその他の関連する義務を同時に 満たすように頒布することができない場合、結果としてあなたは『プログラム』を一切 頒布してはならない。

source: If you choose to make the registry entries manually (explained below), absolutely no external software is needed to remap your keyboard.
ja: レジストリエントリを手動で作成する場合（以下で説明）、キーボードのリマッピングに外部ソフトウェアはまったく必要ありません。

source: If you define a property, it can have whatever meaning you want.
ja: プロパティを定義すれば、どんな意味でも持つことができます。

source: If you do not need the substrings to be permanently stored in memory, consider using a parsing loop -- especially if String is very large, in which case a large amount of memory would be saved.
ja: 部分文字列を永久にメモリに保存する必要がない場合は、構文解析ループを使用することを検討する。特にStringが非常に大きい場合は、大量のメモリを節約できる。

source: If you do not specify this style, pressing Enter has the same effect as pressing the dialog box's default push button.
ja: このスタイルを指定しない場合、Enterを押すとダイアログボックスのデフォルトのプッシュボタンを押したのと同じ効果が得られます。

source: If you do not specify this style, the scroll bar is hidden when the list box does not contain enough items.
ja: このスタイルを指定しないと、リストボックスに十分な項目がない場合にスクロール・バーが非表示になります。

source: If you do not wish to monitor a system message (that is, one below 0x0400), it is best to choose a number greater than 4096 (0x1000) to the extent you have a choice.
ja: システムメッセージ（つまり0x0400以下のもの）を監視したくない場合は、選択の余地がある範囲で4096（0x1000）より大きい数字を選ぶとよいでしょう。

source: If you don't get an answer right away, wait at least 1 day (24 hours) before asking for more help.
ja: すぐに回答が得られない場合は、少なくとも1日（24時間）待ってから問い合わせること。

source: If you don't need to find the file itself, there are also a number of ways to launch it:
ja: ファイルそのものを探す必要がなければ、それを起動する方法もいくつかあります：

source: If you get a UAC prompt, hold Ctrl or Shift as you click Yes/Continue.
ja: UACプロンプトが表示された場合は、CtrlまたはShiftを押したまま「はい/続行」をクリックしてください。

source: If you get confused, try reading the section again.
ja: もし混乱したら、もう一度そのセクションを読んでみてください。

source: If you have a five-button mouse whose fourth and fifth buttons cannot be seen, you can try changing your mouse driver to the default driver included with the OS.
ja: 第4ボタンと第5ボタンが見えない5ボタンマウスをお使いの場合は、マウスドライバーをOSに付属のデフォルトドライバーに変更してみてください。

source: If you have manually extracted the setup files from the installer EXE, use either setup.exe /S or AutoHotkeyU32.exe Installer.ahk /S.
ja: インストーラーEXEから手動でセットアップファイルを抽出した場合は、setup.exe /SまたはAutoHotkeyU32.exe Installer.ahk /Sのいずれかを使用してください。

source: If you have not already downloaded AutoHotkey, you can get it from one of the following locations:
ja: AutoHotkeyをまだダウンロードしていない方は、以下のいずれかの場所から入手することができます：

source: If you have problems installing AutoHotkey, please try searching for your issue on the forum or start a new topic to get help or report the issue.
ja: AutoHotkeyのインストールに問題がある場合、フォーラムで問題を検索するか、新しいトピックを立ち上げてヘルプを得たり問題を報告したりしてみてください。

source: If you have trouble getting a script to recognize your joystick, one person reported needing to specify a joystick number other than 1 even though only a single joystick was present.
ja: ジョイスティックが1本しかないのに、1以外のジョイスティック番号を指定する必要があったという報告もあり、ジョイスティックを認識させるのに苦労しているようです。

source: If you have used this to install AutoHotkey, the help file for each version should be in a subdirectory of the location where AutoHotkey was installed, such as "C:\Program Files\AutoHotkey\v2.0-beta.7".
ja: これを使ってAutoHotkeyをインストールした場合、各バージョンのヘルプファイルは、AutoHotkeyをインストールした場所のサブディレクトリ、例えば「C:\Program FilesAutoHotkey\v2.0-beta.7」の中にあるはずです。

source: If you haven't selected a default editor yet, you should be prompted to select one.
ja: まだデフォルトのエディタを選択していない場合は、エディタを選択するプロンプトが表示されます。

source: If you know what the maximum number of replacements will be, specifying that for the Limit parameter improves performance because the search can be stopped early (this might also reduce the memory load on the system during the operation).
ja: 最大置換数がわかっている場合、Limitパラメータにそれを指定すると、検索を早期に停止できるため、パフォーマンスが向上します（これにより、操作中のシステムのメモリ負荷も軽減される可能性があります）。

source: If you launch AutoHotkey from the Start menu or by running AutoHotkey.exe directly (without command line parameters), it will look for a script in one of the locations shown above.
ja: スタートメニューからAutoHotkeyを起動するか、AutoHotkey.exeを直接実行（コマンドラインパラメータなし）すると、上記のいずれかの場所にあるスクリプトを探します。

source: If you make a mistake in a script, sometimes it can make the computer harder to use.
ja: スクリプトを間違えると、時にはコンピュータが使いづらくなることもあります。

source: If you manually extracted the files, the help file should be wherever you put it.
ja: 手動でファイルを解凍した場合、ヘルプファイルはどこに置いても差し支えありません。

source: If you need more precision than A_TickCount's 10 ms, use QueryPerformanceCounter().
ja: A_TickCountの10ミリ秒よりも高い精度が必要な場合は、QueryPerformanceCounter()を使用する。

source: If you prefer to make useful hotkeys while learning, check out How to Write Hotkeys first.
ja: 学習しながら便利なホットキーを作りたい方は、まず「ホットキーの書き方」をご覧ください。

source: If you press one of the hotkeys while the mouse cursor is hovering over a pixel that is invisible as a result of TransColor, the window visible beneath that pixel will be acted upon instead!
ja: TransColorの結果不可視になったピクセルの上にマウスカーソルがあるときにホットキーのいずれかを押すと、そのピクセルの下に表示されているウィンドウが代わりに操作されます！

source: If you receive a prompt like "The publisher could not be verified.
ja: 「発行元を確認できませんでした。

source: If you remap a key or mouse button to become Alt, that key will probably not be able to alt-tab properly.
ja: キーやマウスボタンをAltにリマップした場合、そのキーはおそらくAltタブがうまくできないだろう。

source: If you run AutoHotkey32.exe without parameters, it will attempt to load AutoHotkey32.ahk.
ja: パラメータなしでAutoHotkey32.exeを実行すると、AutoHotkey32.ahkをロードしようとします。

source: If you run an example like SendText "Hi!", the text will be immediately sent to the active (focused) window, which might be less than useful depending on how you ran the example.
ja: SendText "Hi!"のような例を実行すると、テキストはアクティブ（フォーカス）なウィンドウに即座に送信されるので、例の実行方法によってはあまり役に立たないかもしれません。

source: If you run it from a 32-bit script, you will likely see PROCESSOR_ARCHITECTURE=x86 and ProgramFiles=C:\Program Files (x86).
ja: 32ビットスクリプトから実行した場合、PROCESSOR_ARCHITECTURE=x86、ProgramFiles=C:\Program Files (x86) と表示されると思います。

source: If you run the example below, pressing Ctrl+CapsLock+Space or Ctrl+Space+CapsLock should show a message:
ja: 以下の例を実行すると、Ctrl+CapsLock+SpaceまたはCtrl+Space+CapsLockを押すと、メッセージが表示されるはずです：

source: If you save this into a file and run the file by double-clicking it, it will likely maximize the File Explorer window which contains the file.
ja: これをファイルに保存して、そのファイルをダブルクリックで実行すると、そのファイルを含むファイルエクスプローラーのウィンドウが最大化されるようです。

source: If you specify 255 shades of variation, all colors will match.
ja: 255色のバリエーションを指定した場合、すべての色が一致します。

source: If you specify ES_NOHIDESEL, the selected text is inverted, even if the control does not have the focus.
ja: ES_NOHIDESELを指定すると、コントロールにフォーカスがなくても選択テキストが反転表示されます。

source: If you specify a relative path for the program, it is relative to this directory.
ja: プログラムに相対パスを指定した場合は、このディレクトリからの相対パスとなります。

source: If you still get an error, modify your code some more.
ja: それでもエラーが出る場合は、コードをもう少し修正してください。

source: If you try something and it gives you an error, study that error.
ja: 何かを試してエラーが出たら、そのエラーを研究すること。

source: If you type the case in any other way, the replacement is sent exactly as defined.
ja: それ以外の方法でケースを打ち込むと、定義通りに交換品が送られます。

source: If you type the first letter in caps, the first letter of the replacement will also be capitalized (if it is a letter).
ja: 最初の文字を大文字で入力すると、置換の最初の文字も大文字になります（文字である場合）。

source: If you use multiple languages or keyboard layouts, Input uses the keyboard layout of the active window rather than the script's (regardless of whether the Input is visible).
ja: 複数の言語やキーボードレイアウトを使用している場合、Inputはスクリプトのキーボードレイアウトではなく、アクティブウィンドウのキーボードレイアウトを使用します（Inputが表示されているかどうかは関係ありません）。

source: If you use multiple languages or keyboard layouts, InputHook uses the keyboard layout of the active window rather than the script's (regardless of whether the Input is visible).
ja: 複数の言語やキーボードレイアウトを使用している場合、InputHookはスクリプトのキーボードレイアウトではなく、アクティブウィンドウのキーボードレイアウトを使用します（Inputが表示されているかどうかは関係ありません）。

source: If you use this for a script that has hotkeys, you might want to bind a hotkey to the ExitApp function.
ja: ホットキーを持つスクリプトに使用する場合、ExitApp関数にホットキーをバインドしたほうがいいでしょう。

source: If you want to check for the existence of files and folders, use FileExist instead.
ja: ファイルやフォルダの存在を確認したい場合は、FileExistを代わりに使用します。

source: If you want to learn more about that stuff, visit the Run page.
ja: そのようなことについてもっと知りたければ、Runのページをご覧ください。

source: If you want to pass an empty string as a parameter, specify two consecutive quotation marks.
ja: 空文字列をパラメータとして渡したい場合は、連続する2つの引用符を指定する。

source: If you want to return extra results from a function, you may also use ByRef (&):
ja: 関数から余分な結果を返したい場合は、ByRef（&）を使用することもできます：

source: If you were to ignore WinTitle, WinText, it would look like this and cause issues:
ja: WinTitle, WinTextを無視すると、このようになり、問題が発生する：

source: If you wish the timer's first execution to be immediate, call the timer's function directly (however, this will not start a new thread like the timer itself does; so settings such as SendMode will not start off at their defaults).
ja: タイマーの初回実行を即座に行いたい場合は、タイマーの関数を直接呼び出します（ただし、タイマーのように新しいスレッドを開始しないので、SendModeなどの設定はデフォルトのままでは始まりません）。

source: If you wish to change both attributes, run the function twice as in this example:
ja: 両方の属性を変更したい場合は、この例のように関数を2回実行してください：

source: If you're already connected to the target computer as a different user (for example, a mapped drive via user Guest), you may have to terminate that connection to allow the remote registry feature to reconnect and re-authenticate you as your own currently logged-on username.
ja: すでに別のユーザーとしてターゲットコンピュータに接続している場合（たとえば、ユーザーGuestでマップされたドライブ）、リモートレジストリ機能で再接続して現在ログオンしているユーザー名で再認証するために、その接続を終了する必要がある場合があります。

source: If you're not sure how to try out the examples, see How to Run Example Code.
ja: 例題を試す方法がわからない場合は、「例題コードを実行する方法」をご覧ください。

source: If you've also updated to a newer version of AutoHotkey, find out which version you had before and then check the changelog and compatibility notes.
ja: また、AutoHotkeyの新しいバージョンにアップデートした場合は、以前使用していたバージョンを確認し、変更履歴と 互換性ノートを確認してください。

source: If you've set the filter to show only wm_command in Winspector Spy and still you're getting a flood of messages then right click that message and select hide (msg name)... you don't want to have a look at a msg that appears without you interacting with the target software.
ja: Winspector Spyでwm_commandだけを表示するようにフィルタを設定してもメッセージが大量に表示される場合は、そのメッセージを右クリックしてhide (msg name)を選択してください。

source: If you've switched operating systems, it is likely that something else has also changed and may be affecting your script.
ja: オペレーティングシステムを変更した場合、他のものも変更されている可能性があり、スクリプトに影響を及ぼしている可能性があります。

source: If your antivirus flags the download as malicious, please refer to the following:
ja: アンチウイルスがダウンロードを悪意あるものと判断した場合は、以下を参照してください：

source: If your computer is setup to run the type of program you want to run, it's very simple:
ja: あなたのコンピューターが、実行したいタイプのプログラムを実行できるようにセットアップされていれば、とても簡単だ：

source: If your editor's command-line usage is something like Editor.exe "Full path of script.ahk", the following can be used to set it as the default editor for ahk files.
ja: エディタのコマンドラインの使い方がEditor.exe "Full path of script.ahk"のような場合、以下のようにしてahkファイル用のデフォルトエディタとして設定することができます。

source: If your key is detectable, make a note of the 3-digit hexadecimal value in the second column of the list (e.g. 159).
ja: キーが検出可能な場合は、リストの2列目にある3桁の16進数値をメモしてください（例：159）。

source: If your key or mouse button is not detectable by the Key History screen, one of the following might help:
ja: キー履歴画面でキーやマウスのボタンが検出できない場合は、次のいずれかが有効な場合があります。

source: If your keyboard layout has AltGr instead of a right Alt key, this series of symbols can usually be used to stand for AltGr.
ja: キーボードレイアウトに右Altキーの代わりにAltGrがある場合、この一連の記号は通常AltGrを表すために使用することができます。

source: If your keyboard layout has AltGr instead of RAlt, you can probably use it as a hotkey prefix via <^>! as described here.
ja: キーボードレイアウトにRAltの代わりにAltGrがある場合、おそらくここで説明されているように、<^>!を介してホットキーのプレフィックスとして使用することができます。

source: If your keyboard or mouse has a key not listed above, you might still be able to make it a hotkey by using the following steps:
ja: キーボードやマウスに上記以外のキーがある場合でも、以下の手順でホットキーにすることができる場合があります：

source: IfMsgBox (MsgBox now returns the button name)
ja: IfMsgBox（MsgBoxはボタン名を返すようになりました）

source: Ignore text.
ja: テキストの無視。

source: Ignored when used with c, d, i, u, or s.
ja: c、d、i、u、s と共に使用する場合は無視されます。

source: Ignores whitespace characters in the pattern except when escaped or inside a character class.
ja: パターン内の空白文字は、エスケープされているか文字クラス内にある場合を除き、無視される。

source: Illustrates the use of this function.
ja: 本機能の使用方法を説明します。

source: Image Handles
ja: イメージハンドル

source: Image Handles - Syntax & Usage | AutoHotkey v2
ja: イメージハンドル - 構文と使用法｜AutoHotkey v2

source: Image handles can be used in place of image filenames to use a bitmap or icon located in the memory.
ja: 画像ファイル名の代わりに画像ハンドルを使えば、メモリ上にあるビットマップやアイコンを使うことができる。

source: ImageListID := IL_Create(10) ; Create an ImageList to hold 10 small icons.
ja: ImageListID :=IL_Create(10) ; 小さなアイコンを10個保持するImageListを作成します。

source: ImageListID2 := IL_Create(10, 10, true) ; A list of large icons to go with the small ones.
ja: ImageListID2 := IL_Create(10, 10, true) ; 小さいアイコンと一緒に大きいアイコンのリストです。

source: ImageSearch - Syntax & Usage | AutoHotkey v2
ja: ImageSearch - 構文と使用法｜AutoHotkey v2

source: ImageSearch can be used to detect graphical objects on the screen that either lack text or whose text cannot be easily retrieved.
ja: ImageSearchは、テキストがない、またはテキストを容易に検索できない画面上のグラフィカルオブジェクトを検出するために使用されます。

source: ImageSearch supports 8-bit color screens (256-color) or higher.
ja: ImageSearchは、8ビットカラー画面（256色）以上に対応しています。

source: Images that are not icons are loaded at their actual size.
ja: アイコンでない画像は、実際のサイズで読み込まれます。

source: Immediately resets the hotstring recognizer.
ja: ホットストリングレコグナイザーを即座にリセットします。

source: Immediately sorts the column in ascending order (even if it has the Desc option).
ja: カラムを即座に昇順でソートします（Descオプションがあっても）。

source: Immediately sorts the column in descending order.
ja: カラムをすぐに降順にソートします。

source: Implementation
ja: 実施

source: Implemented an optimization to the WinText parameter by Descolada.
ja: DescoladaによるWinTextパラメータの最適化を実装しました。

source: Implicit concatenation is also known as auto-concat.
ja: 暗黙の連結は、自動連結とも呼ばれる。

source: Implicit concatenation:
ja: 暗黙の連結：

source: Implicit concatenation: "The value is " MyVar
ja: 暗黙の連結："The value is " MyVar

source: Important Notes
ja: 重要な注意事項

source: Improved error message for some cases of unintended line continuation.
ja: 意図しない行が続く場合のエラーメッセージを改善。

source: Improved property_get to allow calling functions with <=1 parameter.
ja: パラメータを<=1にすることで関数を呼び出せるようにproperty_getを改善しました。

source: Improved the reliability of the script taking focus when a menu popup is shown.
ja: メニューポップアップが表示されたときにフォーカスするスクリプトの信頼性が向上しました。

source: In AutoHotkey the following escape sequences can be used:
ja: AutoHotkeyでは、以下のエスケープシーケンスが使用できます：

source: In AutoHotkey v1.1, InputHook is a replacement for the Input command, offering greater flexbility.
ja: AutoHotkey v1.1では、InputHookがInputコマンドの代わりとなり、より柔軟な操作性を提供します。

source: In AutoHotkey, a class defines properties to be shared by instances of the class (and methods, which are callable properties).
ja: AutoHotkeyでは、classはそのクラスのインスタンスで共有されるプロパティ（および呼び出し可能なプロパティであるメソッド）を定義します。

source: In AutoHotkey, an accent (`) may optionally be used in place of the backslash in these cases.
ja: AutoHotkeyでは、このような場合、バックスラッシュの代わりにアクセント記号(`)を使用することもできます。

source: In AutoHotkey, function calls can be specified with or without parentheses.
ja: AutoHotkeyでは、関数呼び出しは括弧付きでも括弧なしでも指定できます。

source: In AutoHotkey, statements include assignments, function calls and other expressions.
ja: AutoHotkeyでは、ステートメントには、代入、関数呼び出し、その他の式が含まれます。

source: In AutoHotkey, variables are created simply by using them.
ja: AutoHotkeyでは、変数を使用するだけで変数が作成されます。

source: In Explorer, right-click in empty space in the folder where you want to save the script, then select New and AutoHotkey Script.
ja: エクスプローラで、スクリプトを保存するフォルダの何もない場所で右クリックし、[新規作成]から[AutoHotkeyスクリプト]を選択します。

source: In Notepad (or a text editor of your choice), save a file with the .ahk filename extension.
ja: メモ帳（またはお好みのテキストエディタ）で、拡張子.ahkのファイルを保存します。

source: In a single-monitor system, this will be always 1.
ja: モニターが1つしかないときは、戻り値は1になるはずです。

source: In a system with multiple display monitors, this value is the same for all monitors.
ja: 複数のディスプレイモニターがあるシステムでは、この値はすべてのモニターで同じになります。

source: In addition to DBGp support, it provides syntax highlighting, calltips/parameter info and auto-complete for AutoHotkey, and other useful editing features and scripting tools.
ja: DBGpのサポートに加え、AutoHotkeyのシンタックスハイライト、コールチップ/パラメータ情報、オートコンプリートなど、便利な編集機能、スクリプトツールも提供します。

source: In addition to being available for directive parameters, all variables can be accessed from any RT_MENU, RT_DIALOG, RT_STRING, RT_ACCELERATORS, RT_HTML, and RT_MANIFEST file supplied to the AddResource directive, below.
ja: すべての変数は、AddResourceディレクティブのパラメータとして利用できるだけでなく、以下のAddResourceディレクティブに与えられたRT_MENU、RT_DIALOG、RT_STRING、RT_ACCELERATORS、RT_HTML、RT_MANIFESTファイルからアクセスすることができます。

source: In addition to detecting some errors early, this also greatly improves runtime performance.
ja: いくつかのエラーを早期に検出することに加え、これは実行時のパフォーマンスを大幅に向上させます。

source: In addition to navigating from item to item with the keyboard, the user may also perform incremental search by typing the first few characters of an item's name.
ja: キーボードで項目から項目へ移動するだけでなく、項目名の最初の数文字を入力してインクリメンタル検索を行うこともできる。

source: In addition to navigating from row to row with the keyboard, the user may also perform incremental search by typing the first few characters of an item in the first column.
ja: キーボードによる行から行への移動に加えて、ユーザーは最初の列の項目の最初の数文字を入力することによって、インクリメンタルサーチを行うこともできます。

source: In addition to the default methods/properties of a GUI control, ListView controls have the following methods (defined in the Gui.ListView class).
ja: GUIコントロールのデフォルトのメソッド/プロパティに加えて、ListViewコントロールは以下のメソッドを持ちます（Gui.ListViewクラスで定義）。

source: In addition to the default methods/properties of a GUI control, TreeView controls have the following methods (defined in the Gui.TreeView class).
ja: GUIコントロールのデフォルトのメソッド/プロパティに加えて、TreeViewコントロールは以下のメソッドを持ちます（Gui.TreeViewクラスで定義）。

source: In addition to the AutoIt authors already mentioned:
ja: すでに述べたAutoItの作者に加えて：

source: In addition to the keys and mouse buttons on the Key List page, the source key may also be a virtual key (VKnn) or scan code (SCnnn) as described on the special keys page.
ja: キーリストページのキーとマウスボタンに加えて、ソースキーは、スペシャルキーページで説明されているように、バーチャルキー(VKnn)またはスキャンコード(SCnnn)にすることもできる。

source: In addition to the methods and property inherited from Object, Array objects have the following predefined methods and properties.
ja: 配列オブジェクトは、オブジェクトから継承されたメソッドとプロパティに加え、以下の定義済みのメソッドとプロパティを持ちます。

source: In addition to the methods and property inherited from Object, Buffer objects have the following predefined properties.
ja: Objectから継承されたメソッドやプロパティに加え、Bufferオブジェクトは以下の定義済みプロパティを持ちます。

source: In addition to the methods and property inherited from Object, File objects have the following predefined methods and properties.
ja: Objectから継承されたメソッドとプロパティに加えて、Fileオブジェクトは以下の定義済みのメソッドとプロパティを持ちます。

source: In addition to the methods and property inherited from Object, Func objects have the following predefined methods and properties.
ja: Funcオブジェクトは、Objectから継承されたメソッドとプロパティに加え、以下の定義済みのメソッドとプロパティを持ちます。

source: In addition to the methods and property inherited from Object, Gui objects have the following predefined methods and properties.
ja: Guiオブジェクトは、Objectから継承されたメソッドやプロパティに加え、以下のような定義済みのメソッドやプロパティを持ちます。

source: In addition to the methods and property inherited from Object, GuiControl objects may have the following predefined methods and properties.
ja: Objectから継承されたメソッドとプロパティに加えて、GuiControlオブジェクトは、以下の定義済みのメソッドとプロパティを持つことができます。

source: In addition to the methods and property inherited from Object, Map objects have the following predefined methods and properties.
ja: Mapオブジェクトは、Objectから継承されたメソッドやプロパティに加え、以下のような定義済みのメソッドやプロパティを持ちます。

source: In addition to the methods and property inherited from Object, Menu objects have the following predefined methods and properties.
ja: メニューオブジェクトは、Objectから継承されるメソッドとプロパティに加えて、以下の定義済みのメソッドとプロパティを持ちます。

source: In addition to the methods and property inherited from Any, Objects have the following predefined methods and properties.
ja: Anyから継承されるメソッドやプロパティに加え、Objectsは以下のような定義済みのメソッドやプロパティを持ちます。

source: In addition to the parameters received above, the function may also consult the built-in variable A_EventInfo, which contains 0 if the message was sent via SendMessage.
ja: 上記で受け取ったパラメータに加えて、この関数は組み込み変数A_EventInfoを参照することができ、SendMessageでメッセージが送信された場合は0が格納されます。

source: In addition to these variable names, the special variable A_WorkFileName holds the temporary name of the processed .exe file.
ja: これらの変数名に加えて、特殊変数A_WorkFileNameは、処理された.exeファイルの一時的な名前を保持する。

source: In addition, file-reading loops can operate on the entire contents of a file, one line at a time.
ja: また、ファイル読み込みループは、ファイルの内容全体を1行ずつ操作することができます。

source: In addition, LControl & RAlt:: would make AltGr itself into a hotkey.
ja: それに加えて、LControl & RAlt::は、AltGrをホットキーにします。

source: In addition, any spaces or tabs around the delimiting commas are significant, meaning that they are part of the match string.
ja: また、区切りであるカンマの周りにあるスペースやタブは、マッチ文字列の一部であることを意味し、重要な意味を持ちます。

source: In addition, Radio controls have BS_NOTIFY so that double clicks can be detected.
ja: さらに、ラジオコントロールはBS_NOTIFYを持っているので、ダブルクリックを検出することができる。

source: In addition, a StatusBar control shows information about the currently selected folder.
ja: さらに、StatusBarコントロールは、現在選択されているフォルダに関する情報を表示します。

source: In addition, a DropDownList control uses WS_VSCROLL, and a ComboBox control uses WS_VSCROLL and CBS_AUTOHSCROLL.
ja: また、DropDownList コントロールはWS_VSCROLLを使用し、ComboBox コントロールはWS_VSCROLLとCBS_AUTOHSCROLLを使用します。

source: In addition, a single long line can be broken up into several shorter ones by means of a continuation section.
ja: また、1本の長い線を、継続部によっていくつかの短い線に分割することができます。

source: In addition, any short (8.3) folder names in FilePattern will still be short (see next item to get the long version).
ja: また、FilePatternで短い（8.3）フォルダ名は、そのまま短くなります（長いバージョンを取得するには、次の項目を参照してください）。

source: In addition, context sensitive help for AutoHotkey functions can be enabled in any editor via this example.
ja: さらに、AutoHotkey関数のコンテキスト依存ヘルプは、この例を介して任意のエディタで有効にすることができます。

source: In addition, disabled windows are omitted from the alt-tab list.
ja: さらに、無効化されたウィンドウはalt-tabリストから除外されます。

source: In addition, during script execution, binary numbers are cached in variables to avoid conversions to/from strings.
ja: さらに、スクリプトの実行中、文字列との変換を避けるため、2進数は変数にキャッシュされます。
